20260422_051015/mvc-cpu-100-run3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: cpu-bound-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 004/100 VUs, 31 complete and 0 interrupted iterations
default   [   0% ] 004/100 VUs  0m00.9s/4m00.0s

running (0m01.9s), 007/100 VUs, 70 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m01.9s/4m00.0s

running (0m02.9s), 010/100 VUs, 109 complete and 0 interrupted iterations
default   [   1% ] 010/100 VUs  0m02.9s/4m00.0s

running (0m03.9s), 014/100 VUs, 151 complete and 0 interrupted iterations
default   [   2% ] 014/100 VUs  0m03.9s/4m00.0s

running (0m04.9s), 017/100 VUs, 191 complete and 0 interrupted iterations
default   [   2% ] 017/100 VUs  0m04.9s/4m00.0s

running (0m05.9s), 020/100 VUs, 230 complete and 0 interrupted iterations
default   [   2% ] 020/100 VUs  0m05.9s/4m00.0s

running (0m06.9s), 023/100 VUs, 271 complete and 0 interrupted iterations
default   [   3% ] 023/100 VUs  0m06.9s/4m00.0s

running (0m07.9s), 027/100 VUs, 309 complete and 0 interrupted iterations
default   [   3% ] 027/100 VUs  0m07.9s/4m00.0s

running (0m08.9s), 030/100 VUs, 349 complete and 0 interrupted iterations
default   [   4% ] 030/100 VUs  0m08.9s/4m00.0s

running (0m09.9s), 033/100 VUs, 391 complete and 0 interrupted iterations
default   [   4% ] 033/100 VUs  0m09.9s/4m00.0s

running (0m10.9s), 037/100 VUs, 430 complete and 0 interrupted iterations
default   [   5% ] 037/100 VUs  0m10.9s/4m00.0s

running (0m11.9s), 040/100 VUs, 469 complete and 0 interrupted iterations
default   [   5% ] 040/100 VUs  0m11.9s/4m00.0s

running (0m12.9s), 043/100 VUs, 508 complete and 0 interrupted iterations
default   [   5% ] 043/100 VUs  0m12.9s/4m00.0s

running (0m13.9s), 047/100 VUs, 547 complete and 0 interrupted iterations
default   [   6% ] 047/100 VUs  0m13.9s/4m00.0s

running (0m14.9s), 050/100 VUs, 588 complete and 0 interrupted iterations
default   [   6% ] 050/100 VUs  0m14.9s/4m00.0s

running (0m15.9s), 053/100 VUs, 628 complete and 0 interrupted iterations
default   [   7% ] 053/100 VUs  0m15.9s/4m00.0s

running (0m16.9s), 056/100 VUs, 666 complete and 0 interrupted iterations
default   [   7% ] 056/100 VUs  0m16.9s/4m00.0s

running (0m17.9s), 060/100 VUs, 711 complete and 0 interrupted iterations
default   [   7% ] 060/100 VUs  0m17.9s/4m00.0s

running (0m18.9s), 063/100 VUs, 750 complete and 0 interrupted iterations
default   [   8% ] 063/100 VUs  0m18.9s/4m00.0s

running (0m19.9s), 066/100 VUs, 785 complete and 0 interrupted iterations
default   [   8% ] 066/100 VUs  0m19.9s/4m00.0s

running (0m20.9s), 070/100 VUs, 828 complete and 0 interrupted iterations
default   [   9% ] 070/100 VUs  0m20.9s/4m00.0s

running (0m21.9s), 073/100 VUs, 866 complete and 0 interrupted iterations
default   [   9% ] 073/100 VUs  0m21.9s/4m00.0s

running (0m22.9s), 076/100 VUs, 910 complete and 0 interrupted iterations
default   [  10% ] 076/100 VUs  0m22.9s/4m00.0s

running (0m23.9s), 080/100 VUs, 945 complete and 0 interrupted iterations
default   [  10% ] 080/100 VUs  0m23.9s/4m00.0s

running (0m24.9s), 083/100 VUs, 986 complete and 0 interrupted iterations
default   [  10% ] 083/100 VUs  0m24.9s/4m00.0s

running (0m25.9s), 086/100 VUs, 1028 complete and 0 interrupted iterations
default   [  11% ] 086/100 VUs  0m25.9s/4m00.0s

running (0m26.9s), 089/100 VUs, 1065 complete and 0 interrupted iterations
default   [  11% ] 089/100 VUs  0m26.9s/4m00.0s

running (0m27.9s), 093/100 VUs, 1106 complete and 0 interrupted iterations
default   [  12% ] 093/100 VUs  0m27.9s/4m00.0s

running (0m28.9s), 096/100 VUs, 1143 complete and 0 interrupted iterations
default   [  12% ] 096/100 VUs  0m28.9s/4m00.0s

running (0m29.9s), 099/100 VUs, 1184 complete and 0 interrupted iterations
default   [  12% ] 099/100 VUs  0m29.9s/4m00.0s

running (0m30.9s), 100/100 VUs, 1231 complete and 0 interrupted iterations
default   [  13% ] 100/100 VUs  0m30.9s/4m00.0s

running (0m31.9s), 100/100 VUs, 1267 complete and 0 interrupted iterations
default   [  13% ] 100/100 VUs  0m31.9s/4m00.0s

running (0m32.9s), 100/100 VUs, 1310 complete and 0 interrupted iterations
default   [  14% ] 100/100 VUs  0m32.9s/4m00.0s

running (0m33.9s), 100/100 VUs, 1345 complete and 0 interrupted iterations
default   [  14% ] 100/100 VUs  0m33.9s/4m00.0s

running (0m34.9s), 100/100 VUs, 1392 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m34.9s/4m00.0s

running (0m35.9s), 100/100 VUs, 1432 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m35.9s/4m00.0s

running (0m36.9s), 100/100 VUs, 1466 complete and 0 interrupted iterations
default   [  15% ] 100/100 VUs  0m36.9s/4m00.0s

running (0m37.9s), 100/100 VUs, 1519 complete and 0 interrupted iterations
default   [  16% ] 100/100 VUs  0m37.9s/4m00.0s

running (0m38.9s), 100/100 VUs, 1555 complete and 0 interrupted iterations
default   [  16% ] 100/100 VUs  0m38.9s/4m00.0s

running (0m39.9s), 100/100 VUs, 1598 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m39.9s/4m00.0s

running (0m40.9s), 100/100 VUs, 1635 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m40.9s/4m00.0s

running (0m41.9s), 100/100 VUs, 1680 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m41.9s/4m00.0s

running (0m42.9s), 100/100 VUs, 1716 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m42.9s/4m00.0s

running (0m43.9s), 100/100 VUs, 1762 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m43.9s/4m00.0s

running (0m44.9s), 100/100 VUs, 1805 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m44.9s/4m00.0s

running (0m45.9s), 100/100 VUs, 1842 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m45.9s/4m00.0s

running (0m46.9s), 100/100 VUs, 1889 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m46.9s/4m00.0s

running (0m47.9s), 100/100 VUs, 1924 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m47.9s/4m00.0s

running (0m48.9s), 100/100 VUs, 1968 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m48.9s/4m00.0s

running (0m49.9s), 100/100 VUs, 2009 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m49.9s/4m00.0s

running (0m50.9s), 100/100 VUs, 2049 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m50.9s/4m00.0s

running (0m51.9s), 100/100 VUs, 2089 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m51.9s/4m00.0s

running (0m52.9s), 100/100 VUs, 2142 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m52.9s/4m00.0s

running (0m53.9s), 100/100 VUs, 2176 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m53.9s/4m00.0s

running (0m54.9s), 100/100 VUs, 2202 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m54.9s/4m00.0s

running (0m55.9s), 100/100 VUs, 2256 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m55.9s/4m00.0s

running (0m56.9s), 100/100 VUs, 2298 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m56.9s/4m00.0s

running (0m57.9s), 100/100 VUs, 2335 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m57.9s/4m00.0s

running (0m58.9s), 100/100 VUs, 2382 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m58.9s/4m00.0s

running (0m59.9s), 100/100 VUs, 2421 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m59.9s/4m00.0s

running (1m00.9s), 100/100 VUs, 2466 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  1m00.9s/4m00.0s

running (1m01.9s), 100/100 VUs, 2502 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  1m01.9s/4m00.0s

running (1m02.9s), 100/100 VUs, 2541 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  1m02.9s/4m00.0s

running (1m03.9s), 100/100 VUs, 2585 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m03.9s/4m00.0s

running (1m04.9s), 100/100 VUs, 2627 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m04.9s/4m00.0s

running (1m05.9s), 100/100 VUs, 2669 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  1m05.9s/4m00.0s

running (1m06.9s), 100/100 VUs, 2710 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  1m06.9s/4m00.0s

running (1m07.9s), 100/100 VUs, 2753 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  1m07.9s/4m00.0s

running (1m08.9s), 100/100 VUs, 2784 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  1m08.9s/4m00.0s

running (1m09.9s), 100/100 VUs, 2836 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  1m09.9s/4m00.0s

running (1m10.9s), 100/100 VUs, 2878 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m10.9s/4m00.0s

running (1m11.9s), 100/100 VUs, 2916 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m11.9s/4m00.0s

running (1m12.9s), 100/100 VUs, 2958 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  1m12.9s/4m00.0s

running (1m13.9s), 100/100 VUs, 2996 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  1m13.9s/4m00.0s

running (1m14.9s), 100/100 VUs, 3043 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  1m14.9s/4m00.0s

running (1m15.9s), 100/100 VUs, 3082 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m15.9s/4m00.0s

running (1m16.9s), 100/100 VUs, 3120 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m16.9s/4m00.0s

running (1m17.9s), 100/100 VUs, 3160 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  1m17.9s/4m00.0s

running (1m18.9s), 100/100 VUs, 3213 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  1m18.9s/4m00.0s

running (1m19.9s), 100/100 VUs, 3244 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  1m19.9s/4m00.0s

running (1m20.9s), 100/100 VUs, 3287 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m20.9s/4m00.0s

running (1m21.9s), 100/100 VUs, 3327 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m21.9s/4m00.0s

running (1m22.9s), 100/100 VUs, 3367 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m22.9s/4m00.0s

running (1m23.9s), 100/100 VUs, 3415 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m23.9s/4m00.0s

running (1m24.9s), 100/100 VUs, 3449 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m24.9s/4m00.0s

running (1m25.9s), 100/100 VUs, 3494 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m25.9s/4m00.0s

running (1m26.9s), 100/100 VUs, 3540 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m26.9s/4m00.0s

running (1m27.9s), 100/100 VUs, 3569 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m27.9s/4m00.0s

running (1m28.9s), 100/100 VUs, 3622 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m28.9s/4m00.0s

running (1m29.9s), 100/100 VUs, 3657 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m29.9s/4m00.0s

running (1m30.9s), 100/100 VUs, 3698 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m30.9s/4m00.0s

running (1m31.9s), 100/100 VUs, 3745 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m31.9s/4m00.0s

running (1m32.9s), 100/100 VUs, 3777 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m32.9s/4m00.0s

running (1m33.9s), 100/100 VUs, 3823 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m33.9s/4m00.0s

running (1m34.9s), 100/100 VUs, 3861 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m34.9s/4m00.0s

running (1m35.9s), 100/100 VUs, 3902 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m35.9s/4m00.0s

running (1m36.9s), 100/100 VUs, 3944 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m36.9s/4m00.0s

running (1m37.9s), 100/100 VUs, 3989 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m37.9s/4m00.0s

running (1m38.9s), 100/100 VUs, 4035 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m38.9s/4m00.0s

running (1m39.9s), 100/100 VUs, 4067 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m39.9s/4m00.0s

running (1m40.9s), 100/100 VUs, 4111 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m40.9s/4m00.0s

running (1m41.9s), 100/100 VUs, 4152 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m41.9s/4m00.0s

running (1m42.9s), 100/100 VUs, 4200 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m42.9s/4m00.0s

running (1m43.9s), 100/100 VUs, 4240 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m43.9s/4m00.0s

running (1m44.9s), 100/100 VUs, 4277 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m44.9s/4m00.0s

running (1m45.9s), 100/100 VUs, 4315 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m45.9s/4m00.0s

running (1m46.9s), 100/100 VUs, 4365 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m46.9s/4m00.0s

running (1m47.9s), 100/100 VUs, 4397 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m47.9s/4m00.0s

running (1m48.9s), 100/100 VUs, 4442 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m48.9s/4m00.0s

running (1m49.9s), 100/100 VUs, 4484 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m49.9s/4m00.0s

running (1m50.9s), 100/100 VUs, 4529 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m50.9s/4m00.0s

running (1m51.9s), 100/100 VUs, 4566 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m51.9s/4m00.0s

running (1m52.9s), 100/100 VUs, 4603 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m52.9s/4m00.0s

running (1m53.9s), 100/100 VUs, 4649 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m53.9s/4m00.0s

running (1m54.9s), 100/100 VUs, 4688 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m54.9s/4m00.0s

running (1m55.9s), 100/100 VUs, 4731 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m55.9s/4m00.0s

running (1m56.9s), 100/100 VUs, 4776 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m56.9s/4m00.0s

running (1m57.9s), 100/100 VUs, 4812 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m57.9s/4m00.0s

running (1m58.9s), 100/100 VUs, 4851 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m58.9s/4m00.0s

running (1m59.9s), 100/100 VUs, 4894 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m59.9s/4m00.0s

running (2m00.9s), 100/100 VUs, 4935 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  2m00.9s/4m00.0s

running (2m01.9s), 100/100 VUs, 4975 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m01.9s/4m00.0s

running (2m02.9s), 100/100 VUs, 5020 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m02.9s/4m00.0s

running (2m03.9s), 100/100 VUs, 5062 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m03.9s/4m00.0s

running (2m04.9s), 100/100 VUs, 5103 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m04.9s/4m00.0s

running (2m05.9s), 100/100 VUs, 5147 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m05.9s/4m00.0s

running (2m06.9s), 100/100 VUs, 5177 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m06.9s/4m00.0s

running (2m07.9s), 100/100 VUs, 5224 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m07.9s/4m00.0s

running (2m08.9s), 100/100 VUs, 5264 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m08.9s/4m00.0s

running (2m09.9s), 100/100 VUs, 5300 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m09.9s/4m00.0s

running (2m10.9s), 100/100 VUs, 5351 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m10.9s/4m00.0s

running (2m11.9s), 100/100 VUs, 5391 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m11.9s/4m00.0s

running (2m12.9s), 100/100 VUs, 5421 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m12.9s/4m00.0s

running (2m13.9s), 100/100 VUs, 5469 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m13.9s/4m00.0s

running (2m14.9s), 100/100 VUs, 5517 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m14.9s/4m00.0s

running (2m15.9s), 100/100 VUs, 5552 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m15.9s/4m00.0s

running (2m16.9s), 100/100 VUs, 5594 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m16.9s/4m00.0s

running (2m17.9s), 100/100 VUs, 5641 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m17.9s/4m00.0s

running (2m18.9s), 100/100 VUs, 5675 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m18.9s/4m00.0s

running (2m19.9s), 100/100 VUs, 5715 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m19.9s/4m00.0s

running (2m20.9s), 100/100 VUs, 5757 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m20.9s/4m00.0s

running (2m21.9s), 100/100 VUs, 5798 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m21.9s/4m00.0s

running (2m22.9s), 100/100 VUs, 5844 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m22.9s/4m00.0s

running (2m23.9s), 100/100 VUs, 5881 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m23.9s/4m00.0s

running (2m24.9s), 100/100 VUs, 5921 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m24.9s/4m00.0s

running (2m25.9s), 100/100 VUs, 5963 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m25.9s/4m00.0s

running (2m26.9s), 100/100 VUs, 6010 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m26.9s/4m00.0s

running (2m27.9s), 100/100 VUs, 6043 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m27.9s/4m00.0s

running (2m28.9s), 100/100 VUs, 6090 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m28.9s/4m00.0s

running (2m29.9s), 100/100 VUs, 6125 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m29.9s/4m00.0s

running (2m30.9s), 100/100 VUs, 6169 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m30.9s/4m00.0s

running (2m31.9s), 100/100 VUs, 6213 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m31.9s/4m00.0s

running (2m32.9s), 100/100 VUs, 6259 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m32.9s/4m00.0s

running (2m33.9s), 100/100 VUs, 6300 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m33.9s/4m00.0s

running (2m34.9s), 100/100 VUs, 6336 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m34.9s/4m00.0s

running (2m35.9s), 100/100 VUs, 6375 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m35.9s/4m00.0s

running (2m36.9s), 100/100 VUs, 6420 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m36.9s/4m00.0s

running (2m37.9s), 100/100 VUs, 6456 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m37.9s/4m00.0s

running (2m38.9s), 100/100 VUs, 6501 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m38.9s/4m00.0s

running (2m39.9s), 100/100 VUs, 6543 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m39.9s/4m00.0s

running (2m40.9s), 100/100 VUs, 6578 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m40.9s/4m00.0s

running (2m41.9s), 100/100 VUs, 6625 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m41.9s/4m00.0s

running (2m42.9s), 100/100 VUs, 6658 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m42.9s/4m00.0s

running (2m43.9s), 100/100 VUs, 6707 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m43.9s/4m00.0s

running (2m44.9s), 100/100 VUs, 6752 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m44.9s/4m00.0s

running (2m45.9s), 100/100 VUs, 6781 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m45.9s/4m00.0s

running (2m46.9s), 100/100 VUs, 6831 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m46.9s/4m00.0s

running (2m47.9s), 100/100 VUs, 6868 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m47.9s/4m00.0s

running (2m48.9s), 100/100 VUs, 6911 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m48.9s/4m00.0s

running (2m49.9s), 100/100 VUs, 6956 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m49.9s/4m00.0s

running (2m50.9s), 100/100 VUs, 6995 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m50.9s/4m00.0s

running (2m51.9s), 100/100 VUs, 7036 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m51.9s/4m00.0s

running (2m52.9s), 100/100 VUs, 7072 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m52.9s/4m00.0s

running (2m53.9s), 100/100 VUs, 7125 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m53.9s/4m00.0s

running (2m54.9s), 100/100 VUs, 7159 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m54.9s/4m00.0s

running (2m55.9s), 100/100 VUs, 7204 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m55.9s/4m00.0s

running (2m56.9s), 100/100 VUs, 7254 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m56.9s/4m00.0s

running (2m57.9s), 100/100 VUs, 7279 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m57.9s/4m00.0s

running (2m58.9s), 100/100 VUs, 7331 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m58.9s/4m00.0s

running (2m59.9s), 100/100 VUs, 7367 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m59.9s/4m00.0s

running (3m00.9s), 100/100 VUs, 7404 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  3m00.9s/4m00.0s

running (3m01.9s), 100/100 VUs, 7457 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m01.9s/4m00.0s

running (3m02.9s), 100/100 VUs, 7509 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m02.9s/4m00.0s

running (3m03.9s), 100/100 VUs, 7535 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m03.9s/4m00.0s

running (3m04.9s), 100/100 VUs, 7562 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m04.9s/4m00.0s

running (3m05.9s), 100/100 VUs, 7621 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m05.9s/4m00.0s

running (3m06.9s), 100/100 VUs, 7654 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m06.9s/4m00.0s

running (3m07.9s), 100/100 VUs, 7693 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m07.9s/4m00.0s

running (3m08.9s), 100/100 VUs, 7740 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m08.9s/4m00.0s

running (3m09.9s), 100/100 VUs, 7779 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m09.9s/4m00.0s

running (3m10.9s), 100/100 VUs, 7813 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m10.9s/4m00.0s

running (3m11.9s), 100/100 VUs, 7861 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m11.9s/4m00.0s

running (3m12.9s), 100/100 VUs, 7902 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m12.9s/4m00.0s

running (3m13.9s), 100/100 VUs, 7938 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m13.9s/4m00.0s

running (3m14.9s), 100/100 VUs, 7985 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m14.9s/4m00.0s

running (3m15.9s), 100/100 VUs, 8028 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m15.9s/4m00.0s

running (3m16.9s), 100/100 VUs, 8065 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m16.9s/4m00.0s

running (3m17.9s), 100/100 VUs, 8104 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m17.9s/4m00.0s

running (3m18.9s), 100/100 VUs, 8147 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m18.9s/4m00.0s

running (3m19.9s), 100/100 VUs, 8191 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m19.9s/4m00.0s

running (3m20.9s), 100/100 VUs, 8229 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m20.9s/4m00.0s

running (3m21.9s), 100/100 VUs, 8276 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m21.9s/4m00.0s

running (3m22.9s), 100/100 VUs, 8315 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m22.9s/4m00.0s

running (3m23.9s), 100/100 VUs, 8355 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m23.9s/4m00.0s

running (3m24.9s), 100/100 VUs, 8397 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m24.9s/4m00.0s

running (3m25.9s), 100/100 VUs, 8435 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m25.9s/4m00.0s

running (3m26.9s), 100/100 VUs, 8479 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m26.9s/4m00.0s

running (3m27.9s), 100/100 VUs, 8515 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m27.9s/4m00.0s

running (3m28.9s), 100/100 VUs, 8562 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m28.9s/4m00.0s

running (3m29.9s), 100/100 VUs, 8601 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m29.9s/4m00.0s

running (3m30.9s), 100/100 VUs, 8650 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  3m30.9s/4m00.0s

running (3m31.9s), 098/100 VUs, 8680 complete and 0 interrupted iterations
default   [  88% ] 098/100 VUs  3m31.9s/4m00.0s

running (3m32.9s), 094/100 VUs, 8727 complete and 0 interrupted iterations
default   [  89% ] 094/100 VUs  3m32.9s/4m00.0s

running (3m33.9s), 091/100 VUs, 8771 complete and 0 interrupted iterations
default   [  89% ] 091/100 VUs  3m33.9s/4m00.0s

running (3m34.9s), 089/100 VUs, 8809 complete and 0 interrupted iterations
default   [  90% ] 089/100 VUs  3m34.9s/4m00.0s

running (3m35.9s), 085/100 VUs, 8858 complete and 0 interrupted iterations
default   [  90% ] 085/100 VUs  3m35.9s/4m00.0s

running (3m36.9s), 080/100 VUs, 8896 complete and 0 interrupted iterations
default   [  90% ] 080/100 VUs  3m36.9s/4m00.0s

running (3m37.9s), 077/100 VUs, 8944 complete and 0 interrupted iterations
default   [  91% ] 077/100 VUs  3m37.9s/4m00.0s

running (3m38.9s), 074/100 VUs, 8981 complete and 0 interrupted iterations
default   [  91% ] 074/100 VUs  3m38.9s/4m00.0s

running (3m39.9s), 072/100 VUs, 9024 complete and 0 interrupted iterations
default   [  92% ] 072/100 VUs  3m39.9s/4m00.0s

running (3m40.9s), 068/100 VUs, 9069 complete and 0 interrupted iterations
default   [  92% ] 068/100 VUs  3m40.9s/4m00.0s

running (3m41.9s), 065/100 VUs, 9117 complete and 0 interrupted iterations
default   [  92% ] 065/100 VUs  3m41.9s/4m00.0s

running (3m42.9s), 060/100 VUs, 9154 complete and 0 interrupted iterations
default   [  93% ] 060/100 VUs  3m42.9s/4m00.0s

running (3m43.9s), 056/100 VUs, 9198 complete and 0 interrupted iterations
default   [  93% ] 056/100 VUs  3m43.9s/4m00.0s

running (3m44.9s), 054/100 VUs, 9249 complete and 0 interrupted iterations
default   [  94% ] 054/100 VUs  3m44.9s/4m00.0s

running (3m45.9s), 051/100 VUs, 9280 complete and 0 interrupted iterations
default   [  94% ] 051/100 VUs  3m45.9s/4m00.0s

running (3m46.9s), 048/100 VUs, 9323 complete and 0 interrupted iterations
default   [  95% ] 048/100 VUs  3m46.9s/4m00.0s

running (3m47.9s), 043/100 VUs, 9371 complete and 0 interrupted iterations
default   [  95% ] 043/100 VUs  3m47.9s/4m00.0s

running (3m48.9s), 040/100 VUs, 9410 complete and 0 interrupted iterations
default   [  95% ] 040/100 VUs  3m48.9s/4m00.0s

running (3m49.9s), 035/100 VUs, 9455 complete and 0 interrupted iterations
default   [  96% ] 035/100 VUs  3m49.9s/4m00.0s

running (3m50.9s), 032/100 VUs, 9500 complete and 0 interrupted iterations
default   [  96% ] 032/100 VUs  3m50.9s/4m00.0s

running (3m51.9s), 028/100 VUs, 9545 complete and 0 interrupted iterations
default   [  97% ] 028/100 VUs  3m51.9s/4m00.0s

running (3m52.9s), 026/100 VUs, 9590 complete and 0 interrupted iterations
default   [  97% ] 026/100 VUs  3m52.9s/4m00.0s

running (3m53.9s), 022/100 VUs, 9629 complete and 0 interrupted iterations
default   [  97% ] 022/100 VUs  3m53.9s/4m00.0s

running (3m54.9s), 017/100 VUs, 9674 complete and 0 interrupted iterations
default   [  98% ] 017/100 VUs  3m54.9s/4m00.0s

running (3m55.9s), 015/100 VUs, 9716 complete and 0 interrupted iterations
default   [  98% ] 015/100 VUs  3m55.9s/4m00.0s

running (3m56.9s), 012/100 VUs, 9758 complete and 0 interrupted iterations
default   [  99% ] 012/100 VUs  3m56.9s/4m00.0s

running (3m57.9s), 008/100 VUs, 9805 complete and 0 interrupted iterations
default   [  99% ] 008/100 VUs  3m57.9s/4m00.0s

running (3m58.9s), 004/100 VUs, 9847 complete and 0 interrupted iterations
default   [ 100% ] 004/100 VUs  3m58.9s/4m00.0s

running (3m59.9s), 001/100 VUs, 9885 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  3m59.9s/4m00.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=3.33s
    ✓ 'p(99)<10000' p(99)=3.71s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 39548   164.770318/s
    checks_succeeded...: 100.00% 39548 out of 39548
    checks_failed......: 0.00%   0 out of 39548

    ✓ status is 200
    ✓ content-type is json
    ✓ workloadType is CPU-BOUND
    ✓ executionTimeMs exists

    CUSTOM
    response_time_ms...............: min=46.267561 avg=2132.62175 med=2274.910875 max=4538.890244 p(90)=3124.773524 p(95)=3335.08848 p(99)=3717.002697
    successful_requests............: 9887   41.19258/s

    HTTP
    http_req_duration..............: min=46.26ms   avg=2.13s      med=2.27s       max=4.53s       p(90)=3.12s       p(95)=3.33s      p(99)=3.71s      
      { expected_response:true }...: min=46.26ms   avg=2.13s      med=2.27s       max=4.53s       p(90)=3.12s       p(95)=3.33s      p(99)=3.71s      
    http_req_failed................: 0.00%  0 out of 9887
    http_reqs......................: 9887   41.19258/s

    EXECUTION
    iteration_duration.............: min=46.42ms   avg=2.13s      med=2.27s       max=4.53s       p(90)=3.12s       p(95)=3.33s      p(99)=3.71s      
    iterations.....................: 9887   41.19258/s
    vus............................: 1      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 2.8 MB 12 kB/s
    data_sent......................: 791 kB 3.3 kB/s



running (4m00.0s), 000/100 VUs, 9887 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  4m0s